In [32]:
import pandas as pd

# Selection

In [33]:
data = {"name": ["lily","lucy","paul","sun"],
        "age": [23,40,50,71],
        "heigh": [170,173,165,190]}
df = pd.DataFrame(data)
df

   age  heigh  name
0   23    170  lily
1   40    173  lucy
2   50    165  paul
3   71    190   sun

In [34]:
df.name == "lily"

0     True
1    False
2    False
3    False
Name: name, dtype: bool

In [35]:
df[df.name == "lily"]

   age  heigh  name
0   23    170  lily

In [36]:
df.name.str.contains("l")

0     True
1     True
2     True
3    False
Name: name, dtype: bool

In [37]:
df[df.name.str.contains("l")]

   age  heigh  name
0   23    170  lily
1   40    173  lucy
2   50    165  paul

In [38]:
df[df.name.str.contains("l") & (df.heigh > 170)]

   age  heigh  name
1   40    173  lucy

In [39]:
df.query('age > 10 or name == "lily" ')

   age  heigh  name
0   23    170  lily
1   40    173  lucy
2   50    165  paul
3   71    190   sun

In [40]:
df.head(2)

   age  heigh  name
0   23    170  lily
1   40    173  lucy

In [41]:
df.tail(3)

   age  heigh  name
1   40    173  lucy
2   50    165  paul
3   71    190   sun

In [48]:
df["age"]

0    23
1    40
2    50
3    71
Name: age, dtype: int64

In [59]:
df.iloc[[2,1,0]]

   age  heigh  name
2   50    165  paul
1   40    173  lucy
0   23    170  lily

In [56]:
df.iloc[1]

age        40
heigh     173
name     lucy
Name: 1, dtype: object

In [55]:
df.loc[1]

age        40
heigh     173
name     lucy
Name: 1, dtype: object